public static class VersionCtrl
{
    public static readonly string CurrentVersion = "ver.1.0.3";
    /***** ver.1.0.1 업데이트 내역 *****/
    /*
        최초 Release
        싱글플레이 모드
            - 스테이지 모드 (공 굴려서 골인) 추가
                (튜토리얼1 ~ 스테이지4)
            - 아케이드 모드 (공 위에서 배틀로얄~!) 추가
            - 연습 모드 추가
        커스터 마이징 기능 추가
        코인 상점 추가
        사운드 설정 기능 추가
    */
    /***** ver.1.0.2 업데이트 내역 *****/
    /*
        게임 이름 변경 CapsuleFights => CapsuleRolls
        [개선 사항]
        게임 조작 변경
            PC
            - WASD 좌우 이동 추가
            - 마우스 이동으로 시야 전환
            모바일
            - 조이스틱으로 좌우 이동 추가
            - 화면 빈공간 드래그로 시야 전환
        게임 컨트롤 설정 추가
            - 회전 민감도 조절 가능
        싱글플레이
            - 게임 종료 시 간헐적으로 프리징 발생 하는 버그 수정
            - 시간 3초 남았을 시 시각 이펙트 추가
            - 스테이지 모드 비주얼 업데이트
            - 아케이드 모드 게임이름 변경
            - 아케이드 모드 적 AI 플레이어 감지 판정 완화
            - 아케이드 모드 적 아웃 시 무조건 시간 추가하도록 변경
            - 아케이드 모드 시간 추가 이펙트 추가
    */
    /***** ver.1.0.3 업데이트 내역 *****/
    /*
        모바일 타이틀에서 넘어갈 때 바로 메인메뉴 클릭되는 현상 수정
        
        게임 조작 개선
            모바일
            - 화면 빈공간 드래그로 시야 전환 시 
            조이스틱과 겹칠 때 생기는 버그 수정
            - 일시정지가 안눌리는 버그 수정
    */
}
